In [1]:
import pandas as pd
import numpy as np

In [6]:
usuarios = {'nombre': ['Montgomery', 'Dagmar', 'Reeba', 'Shalom', 'Broddy', 'Aurelia'],
            'apellido': ['Humes', 'Elstow', 'Wattisham', 'Alen', 'Keningham', 'Brechin'],
            'edad': [27, 41, 29, 29, 21, 33],
            'sexo': ['Male', 'Female', 'Female', 'Male', 'Male', 'Female'],
            'ventas': [92, 65, 56, 59, 26, 65],
            'codigo':['236', '-105', '304', '506', '145', 'No disponible'],
            'fecha_nac': ['2000-01-15', '1995-02-20', '1988-03-25', '2004-09-25', '1970-11-05', '2001-08-08']}
df_users = pd.DataFrame(usuarios)
df_users

       nombre   apellido  edad    sexo  ventas         codigo   fecha_nac
0  Montgomery      Humes    27    Male      92            236  2000-01-15
1      Dagmar     Elstow    41  Female      65           -105  1995-02-20
2       Reeba  Wattisham    29  Female      56            304  1988-03-25
3      Shalom       Alen    29    Male      59            506  2004-09-25
4      Broddy  Keningham    21    Male      26            145  1970-11-05
5     Aurelia    Brechin    33  Female      65  No disponible  2001-08-08

In [7]:
# Forma 1
df_users['sexo'] = df_users['sexo'].str.replace('Male', 'Masculino', regex=False)

In [ ]:
# Forma 2
df_users.loc[df_users['sexo'] == 'Female', 'sexo'] = 'Femenino'

In [4]:
df_users.dtypes

nombre       object
apellido     object
edad          int64
sexo         object
ventas        int64
codigo       object
fecha_nac    object
dtype: object

In [8]:
df_users

       nombre   apellido  edad       sexo  ventas         codigo   fecha_nac
0  Montgomery      Humes    27  Masculino      92            236  2000-01-15
1      Dagmar     Elstow    41     Female      65           -105  1995-02-20
2       Reeba  Wattisham    29     Female      56            304  1988-03-25
3      Shalom       Alen    29  Masculino      59            506  2004-09-25
4      Broddy  Keningham    21  Masculino      26            145  1970-11-05
5     Aurelia    Brechin    33     Female      65  No disponible  2001-08-08